**Step 1: Data Exploration & Loading & Cleaning**

In [5]:
import pandas as pd
print(pd.__version__)

2.3.0

In [6]:
df = pd.read_csv('data/Walmart.csv', encoding_errors = 'ignore')
df.shape

(10051, 11)

In [7]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [8]:
df.describe() #descriptive stats for continuous vars

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

In [9]:
df.describe(include='object') #descriptive stats for categorical vars

,Branch,City,category,unit_price,date,time,payment_method
count,10051,10051,10051,10020,10051,10051,10051
unique,100,98,6,1008,1460,1001,3
top,WALM058,Weslaco,Fashion accessories,$63,01/12/21,15:48:00,Credit card
freq,240,399,4579,159,48,33,4260

In [10]:
df.info() #info about each column
#unit_price should be float instead of object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [11]:
df.duplicated().sum() #tell no of duplicated rows

np.int64(51)

In [12]:
df.drop_duplicates(inplace=True) #inplace=True means modifies original object
df.duplicated().sum()

np.int64(0)

In [13]:
df.shape #now it shows 10000 instead of 10051

(10000, 11)

In [14]:
df.isnull().sum() #showing which column have null values and how many

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity          31
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [15]:
df.dropna(inplace=True) #dropping rows having any null value

In [16]:
df.isnull().sum() #verify

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [17]:
df.shape

(9969, 11)

In [18]:
#removing dollar sign in unit_price
#.str is pandas method, turns all values of a column into string
df['unit_price'] = df['unit_price'].str.replace('$','').astype(float)

In [19]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   float64
 6   date            9969 non-null   object
 7   time            9969 non-null   object
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: float64(4), int64(1), object(6)
memory usage: 934.6+ KB

In [21]:
#create one more column
df['total'] = df['unit_price']*df['quantity']
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin,total
0,1,WALM003,San Antonio,Health and beauty,74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48,522.83
1,2,WALM048,Harlingen,Electronic accessories,15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48,76.40
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33,324.31
3,4,WALM064,Bedford,Health and beauty,58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33,465.76
4,5,WALM013,Irving,Sports and travel,86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48,604.17

In [22]:
df.to_csv('data/walmart_clean_data.csv', index=False)

In [23]:
#mysql toolkit
import pymysql #this will work as adapter
from sqlalchemy import create_engine

In [31]:
#mysql connection
from dotenv import load_dotenv #for loading environment vars since i can't write passwords out in open
import os
from urllib.parse import quote_plus #to encode password(since it contains special chare like @ which is causing error)

load_dotenv()
password = quote_plus(os.getenv("MYSQL_PASSWORD"))

engine_mysql = create_engine(f"mysql+pymysql://root:{password}@localhost:3306/walmart_db")
try:
    engine_mysql
    print("Connection Successful with MySQL DB")
except:
    print("Unable to connect")

Connection Successful with MySQL DB

In [28]:
df.to_sql(name='walmart', con=engine_mysql, if_exists='append', index=False)

9969